# Library

In [1]:
import pandas as pd
import numpy as np

## [로드] 말소 데이터

In [2]:
ex_col_df = pd.read_excel('data/220819_22.06월기준_말소_컬럼.xlsx')
ex_col_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   컬럼명     42 non-null     object
dtypes: object(1)
memory usage: 464.0+ bytes

In [3]:
ex_col_df.head()

        컬럼명
0    차량관리번호
1    차량등록번호
2  본거지법정동코드
3     소유자구분
4   차종_등록정보

In [4]:
ex_col = ex_col_df['컬럼명']
len(ex_col)

42

In [5]:
# 20.8s
ex = pd.read_table('data/220819_22.06월기준_말소.txt', header=42, names=ex_col, usecols=['차대번호', '차량말소YN'], encoding='cp949')
ex.columns

Index(['차대번호', '차량말소YN'], dtype='object')

In [6]:
ex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3653054 entries, 0 to 3653053
Data columns (total 2 columns):
 #   Column  Dtype
---  ------  -----
 0   차대번호    object
 1   차량말소YN  object
dtypes: object(2)
memory usage: 55.7+ MB

## [로드] 컬럼명 데이터

In [7]:
col_df = pd.read_table('data/컬럼명.txt', sep=',')
col= col_df.columns

In [8]:
col

Index(['차량관리번호', '차량등록번호', '본거지법정동코드', '소유자구분', '차종_등록정보', '용도', '차대번호',
       '최초등록일자', '차량연식', '차량제작일자', '검사유효일', '제원관리번호', '배출가스인증번호', '배출가스등급',
       '저공해조치종류', '저공해조치구조변경YN', '차량말소YN', '취득일자', '취득금액', '차명', '차종_제원정보',
       '차종분류', '차종유형', '자동차형식', '제작사명', '연료', '엔진형식', '총중량', '적재중량', '엔진출력',
       '배기량', '승차인원', '차량길이', '차량너비', '차량높이', '원산지명', '삭제YN', '제원승인일자', '구동형식',
       '변속기종류'],
      dtype='object')

## [로드] 파일

In [9]:
# 16.9s
df = pd.read_table('data/220819_22.06월기준_5등급.txt', encoding='cp949', header=40, names=col)
df.info()

C:\Users\kbj\AppData\Local\Temp\ipykernel_11524\2869679680.py:2: DtypeWarning: Columns (7,9,29,37,38) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_table('data/220819_22.06월기준_5등급.txt', encoding='cp949', header=40, names=col)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1186488 entries, 0 to 1186487
Data columns (total 40 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   차량관리번호       1186488 non-null  object
 1   차량등록번호       1186488 non-null  object
 2   본거지법정동코드     1186488 non-null  int64
 3   소유자구분        1186488 non-null  object
 4   차종_등록정보      1186476 non-null  object
 5   용도           1186488 non-null  object
 6   차대번호         1186488 non-null  object
 7   최초등록일자       1186488 non-null  object
 8   차량연식         1186488 non-null  int64
 9   차량제작일자       989593 non-null   object
 10  검사유효일        1185981 non-null  float64
 11  제원관리번호       1186488 non-null  object
 12  배출가스인증번호     560317 non-null   object
 13  배출가스등급       1186488 non-null  int64
 14  저공해조치종류      363785 non-null   object
 15  저공해조치구조변경YN  1186488 non-null  object
 16  차량말소YN       1186488 non-null  object
 17  취득일자         1044935 non-null  float64
 18  취득금액         1070799 non-null  float64
 19  차명           1186487 non-null  object
 20  차종_제원정보      1186488 non-null  object
 21  차종분류         1186488 non-null  object
 22  차종유형         1186488 non-null  object
 23  자동차형식        1185965 non-null  object
 24  제작사명         1183245 non-null  object
 25  연료           1186488 non-null  object
 26  엔진형식         1182990 non-null  object
 27  총중량          1186487 non-null  float64
 28  적재중량         1186478 non-null  float64
 29  엔진출력         1186201 non-null  object
 30  배기량          1186486 non-null  float64
 31  승차인원         1186487 non-null  float64
 32  차량길이         1186487 non-null  float64
 33  차량너비         1186487 non-null  float64
 34  차량높이         1186487 non-null  float64
 35  원산지명         1144734 non-null  object
 36  삭제YN         1186488 non-null  object
 37  제원승인일자       1185300 non-null  object
 38  구동형식         3 non-null        object
 39  변속기종류        1186486 non-null  object
dtypes: float64(10), int64(3), object(27)
memory usage: 362.1+ MB

In [10]:
df['차량말소YN'].unique()

array(['N'], dtype=object)

In [11]:
df2 = df.merge(ex, on='차대번호', how='left')
df2['차량말소YN_y'].unique()

array([nan, 'Y'], dtype=object)

In [12]:
df3 = df2[df2['차량말소YN_y'].isnull() == True]
df3.shape

(1186485, 41)

In [13]:
f = df3.groupby('연료', as_index=False)['차대번호'].count().sort_values('차대번호', ascending=False)
f

            연료     차대번호
2           경유  1155944
5          휘발유    30072
1  LPG(액화석유가스)      438
3         기타연료       25
0  CNG(압축천연가스)        5
4          알코올        1

In [14]:
g = df3.groupby('연료', as_index=False)['차대번호'].groups
g['기타연료']

Int64Index([  43763,   47796,  100764,  119088,  211587,  237587,  240378,
             305685,  390166,  463868,  520389,  547895,  552583,  581438,
             610663,  653677,  712255,  746912,  827629,  874966,  889180,
             962442, 1114452, 1125851, 1147913],
           dtype='int64')

In [15]:
# LNS : -
# ZB : 경유
# G4AJ : 휘발유
# MSV3 : 휘발유
df3.loc[df3['연료'] == '기타연료', '엔진형식'].unique()

array(['3304124', nan, 'LNS', 'ZB', 'G4AJ', '09801220246', 'MSV3'],
      dtype=object)

In [16]:
df3.loc[df3['엔진형식'] == 'ZB', '연료'] = '경유'
df3.loc[df3['엔진형식'] == 'G4AJ', '연료'] = '휘발유'
df3.loc[df3['엔진형식'] == 'MSV3', '연료'] = '휘발유'
df3.loc[df3['연료'] == '기타연료', '차명'].unique()

array(['일산 육륜', '코티나마크IV', '인타담프', '로얄살롱', '도요다코로나', '포니2', '대우8톤카고',
       '맥스디젤삼방', '현대리어엔진버스', '새한버스', '스텔라', '스텔라1.6CXL', '대우11톤카고',
       '아시아AM707중형버스', '도요다웨곤엠브란스', '구급차(도요다)', '브리샤2', '도요다크라운로얄싸롱'],
      dtype=object)

In [17]:
df3.loc[df3['차명'] == '일산 육륜', '연료'] = '경유'
df3.loc[df3['차명'] == '코티나마크IV', '연료'] = '휘발유'
df3.loc[df3['차명'] == '인타담프', '연료'] = '경유'
df3.loc[df3['차명'] == '로얄살롱', '연료'] = '휘발유'
df3.loc[df3['차명'] == '도요다코로나', '연료'] = '휘발유'
df3.loc[df3['차명'] == '포니2', '연료'] = '휘발유'
df3.loc[df3['차명'] == '대우8톤카고', '연료'] = '경유'
df3.loc[df3['차명'] == '맥스디젤삼방', '연료'] = '경유'
df3.loc[df3['차명'] == '현대리어엔진버스', '연료'] = '경유'
df3.loc[df3['차명'] == '새한버스', '연료'] = '경유'
df3.loc[df3['차명'] == '스텔라', '연료'] = '휘발유'
df3.loc[df3['차명'] == '스텔라1.6CXL', '연료'] = '휘발유'
df3.loc[df3['차명'] == '대우11톤카고', '연료'] = '경유'
df3.loc[df3['차명'] == '아시아AM707중형버스', '연료'] = '경유'
df3.loc[df3['차명'] == '도요다웨곤엠브란스', '연료'] = '경유'
df3.loc[df3['차명'] == '구급차(도요다)', '연료'] = '경유'
df3.loc[df3['차명'] == '브리샤2', '연료'] = '휘발유'
df3.loc[df3['차명'] == '도요다크라운로얄싸롱', '연료'] = '휘발유'
df3[df3['연료'] == '기타연료'][['차명', '엔진형식']]

Empty DataFrame
Columns: [차명, 엔진형식]
Index: []

In [18]:
f = df3.groupby('연료', as_index=False)['차대번호'].count().sort_values('차대번호', ascending=False)
f

            연료     차대번호
2           경유  1155957
4          휘발유    30084
1  LPG(액화석유가스)      438
0  CNG(압축천연가스)        5
3          알코올        1

In [19]:
f.columns = ['연료', '5등급']
f

            연료      5등급
2           경유  1155957
4          휘발유    30084
1  LPG(액화석유가스)      438
0  CNG(압축천연가스)        5
3          알코올        1

## [excel] 연료별 통계

In [22]:
f.to_excel('analysis/[G5]연료별_차대번호_통계.xlsx', index=False, encoding='utf-8')

# 지역별 수량 통계

## [로드] 법정동코드

In [20]:
code = pd.read_excel('data/법정동코드_2022.10.14.xlsx')
code.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46340 entries, 0 to 46339
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   법정동코드     46340 non-null  int64
 1   시도        46340 non-null  object
 2   시구군       46317 non-null  object
 3   읍면동       45847 non-null  object
 4   리         33682 non-null  object
 5   지역3       0 non-null      float64
 6   폐지여부      46340 non-null  object
 7   대기관리권역    46340 non-null  object
 8   대기관리권역YN  46334 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 3.2+ MB

In [21]:
code.head()

        법정동코드  시도  시구군  읍면동    리  지역3 폐지여부 대기관리권역 대기관리권역YN
0  1100000000  서울  NaN  NaN  NaN  NaN   존재    수도권        Y
1  1111000000  서울  종로구  NaN  NaN  NaN   존재    수도권        Y
2  1111010100  서울  종로구  청운동  NaN  NaN   존재    수도권        Y
3  1111010200  서울  종로구  신교동  NaN  NaN   존재    수도권        Y
4  1111010300  서울  종로구  궁정동  NaN  NaN   존재    수도권        Y

In [22]:
code['code3'] = code['법정동코드'].astype('str').str[:5]
code.head()

        법정동코드  시도  시구군  읍면동    리  지역3 폐지여부 대기관리권역 대기관리권역YN  code3
0  1100000000  서울  NaN  NaN  NaN  NaN   존재    수도권        Y  11000
1  1111000000  서울  종로구  NaN  NaN  NaN   존재    수도권        Y  11110
2  1111010100  서울  종로구  청운동  NaN  NaN   존재    수도권        Y  11110
3  1111010200  서울  종로구  신교동  NaN  NaN   존재    수도권        Y  11110
4  1111010300  서울  종로구  궁정동  NaN  NaN   존재    수도권        Y  11110

In [23]:
code['code3'] = code['code3'].astype('int')
code['code3'].dtype

dtype('int32')

In [24]:
code = code[['시도', '시구군', '대기관리권역YN', 'code3']]
code.head()

   시도  시구군 대기관리권역YN  code3
0  서울  NaN        Y  11000
1  서울  종로구        Y  11110
2  서울  종로구        Y  11110
3  서울  종로구        Y  11110
4  서울  종로구        Y  11110

In [31]:
code = code.drop_duplicates('code3', keep='first').reset_index(drop=True)
code.head()

   시도  시구군 대기관리권역YN  code3
0  서울  NaN        Y  11000
1  서울  종로구        Y  11110
2  서울   중구        Y  11140
3  서울  용산구        Y  11170
4  서울  성동구        Y  11200

## 법정동 코드와 매칭

In [25]:
df3['본거지법정동코드'].head()

0    4111113000
1    2820010300
2    4519011100
3    4833025321
4    4159035029
Name: 본거지법정동코드, dtype: int64

In [26]:
df3['본거지법정동코드'].isnull().sum()

0

In [27]:
df3['code3'] = df3['본거지법정동코드'].astype('str').str[:5]
df3['code3'] = df3['code3'].astype('int')

C:\Users\kbj\AppData\Local\Temp\ipykernel_11524\327831580.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['code3'] = df3['본거지법정동코드'].astype('str').str[:5]
C:\Users\kbj\AppData\Local\Temp\ipykernel_11524\327831580.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['code3'] = df3['code3'].astype('int')

In [28]:
df3['code3'].head()

0    41111
1    28200
2    45190
3    48330
4    41590
Name: code3, dtype: int32

In [34]:
code['code3'].head()

0    11000
1    11110
2    11140
3    11170
4    11200
Name: code3, dtype: int32

In [32]:
df4 = df3.merge(code, on='code3', how='left')

In [33]:
df4.columns

Index(['차량관리번호', '차량등록번호', '본거지법정동코드', '소유자구분', '차종_등록정보', '용도', '차대번호',
       '최초등록일자', '차량연식', '차량제작일자', '검사유효일', '제원관리번호', '배출가스인증번호', '배출가스등급',
       '저공해조치종류', '저공해조치구조변경YN', '차량말소YN_x', '취득일자', '취득금액', '차명', '차종_제원정보',
       '차종분류', '차종유형', '자동차형식', '제작사명', '연료', '엔진형식', '총중량', '적재중량', '엔진출력',
       '배기량', '승차인원', '차량길이', '차량너비', '차량높이', '원산지명', '삭제YN', '제원승인일자', '구동형식',
       '변속기종류', '차량말소YN_y', 'code3', '시도', '시구군', '대기관리권역YN'],
      dtype='object')

In [36]:
df4[['시도', '시구군', 'code3', '대기관리권역YN']].head()

   시도      시구군  code3 대기관리권역YN
0  경기  수원시 장안구  41111        Y
1  인천      남동구  28200        Y
2  전북      남원시  45190        N
3  경남      양산시  48330        Y
4  경기      화성시  41590        Y

In [38]:
df4['code3'].isnull().sum()

0

In [47]:
df4['시도'].isnull().sum()

0

In [48]:
df4['시구군'].isnull().sum()

4463

In [51]:
df4.loc[df4['시구군'].isnull() == True, '시도'].unique()

array(['세종', '경기'], dtype=object)

In [52]:
df4.loc[(df4['시구군'].isnull() == True) & (df4['시도'] == '세종')].shape

(4462, 45)

In [53]:
df4.loc[(df4['시구군'].isnull() == True) & (df4['시도'] == '경기')].shape

(1, 45)

In [42]:
df4['대기관리권역YN'].value_counts()

Y    895049
N    291435
Name: 대기관리권역YN, dtype: int64

In [43]:
df4['대기관리권역YN'].unique()

array(['Y', 'N', nan], dtype=object)

In [39]:
df5 = df4[df4['연료'] == '경유']
df5.shape

(1155957, 45)

In [54]:
df5.loc[(df5['시구군'].isnull() == True) & (df5['시도'] == '세종')].shape

(4384, 45)

In [55]:
df5.loc[(df5['시구군'].isnull() == True) & (df5['시도'] == '경기')].shape

(0, 45)

In [44]:
l = df5.groupby(['시도', '시구군'], as_index=False)['차대번호'].count()
l

     시도      시구군  차대번호
0    강원      강릉시  6731
1    강원      고성군  1302
2    강원      동해시  2762
3    강원      삼척시  2463
4    강원      속초시  2095
..   ..      ...   ...
251  충북  청주시 상당구  3400
252  충북  청주시 서원구  3510
253  충북  청주시 청원구  3765
254  충북  청주시 흥덕구  4497
255  충북      충주시  5444

[256 rows x 3 columns]

In [45]:
l.columns = ['지역', '시군구', '5등급']
l

     지역      시군구   5등급
0    강원      강릉시  6731
1    강원      고성군  1302
2    강원      동해시  2762
3    강원      삼척시  2463
4    강원      속초시  2095
..   ..      ...   ...
251  충북  청주시 상당구  3400
252  충북  청주시 서원구  3510
253  충북  청주시 청원구  3765
254  충북  청주시 흥덕구  4497
255  충북      충주시  5444

[256 rows x 3 columns]

### [excel] 지역별 수량 통계

In [46]:
l.to_excel('analysis/[G5]지역별_차대번호_통계.xlsx', index=False, encoding='utf-8')

C:\Users\kbj\AppData\Roaming\Python\Python39\site-packages\pandas\util\_decorators.py:211: FutureWarning: the 'encoding' keyword is deprecated and will be removed in a future version. Please take steps to stop the use of 'encoding'
  return func(*args, **kwargs)

# 코드 마지막